{
  "How do I install Valheim Plus?": {
    "answerweb": "Follow the guide here! <a href='https://valheim.plus/installation'>https://valheim.plus/installation</a>.",
    "commanddiscord": "!faq install",
    "answerdiscord": "Follow the guide here! https://valheim.plus/installation",
    "icon": "fas fa-question-circle",
    "id": 1
  },
  "A Valheim Game update was just released, what should I do?": {
    "answerweb": "A new Valheim game update is unlikely to do any more than partially breaking Valheim Plus, however sometimes things are changed in the base game which may completely stop the mod working. In case you encounter any issues, use Steam's verify integrity feature- wait for it to download/update all files and then simply unpack the valheim_Data folder from the downloaded package into your game folder again. This should resolve any issues related.",
    "commanddiscord": "!faq game-update",
    "answerdiscord": "A new Valheim game update is unlikely to do any more than partially breaking Valheim Plus, however sometimes things are changed in the base game which may completely stop the mod working. In case you encounter any issues, use Steam's verify integrity feature- wait for it to download/update all files and then simply unpack the valheim_Data folder from the downloaded package into your game folder again. This should resolve any issues related.",
    "icon": "fas fa-question-circle",
    "id": 2
  },
  "How do I update Valheim Plus?": {
    "answerweb": "When we update Valheim Plus, you will need to follow these steps to get it up and running. You need to follow these steps on your server (if you have one) an your local game client.<br><ul><li>1. Download the latest release from <a href='https://github.com/valheimPlus/ValheimPlus/releases'>https://github.com/valheimPlus/ValheimPlus/releases</a></li><li>2 Unpack the zip and replace all files in the Valheim directory.</li></ul>",
    "commanddiscord": "!faq mod-update",
    "answerdiscord": "When we update Valheim Plus, you will need to follow these steps to get it up and running. You need to follow these steps on your server (if you have one) an your local game client. You need to merge your config with the latest version, you can do that using this tool: https://valheim-plus-config.web.app, then download the latest release from https://github.com/valheimPlus/ValheimPlus/releases, unpack the zip and replace all files in the Valheim directory. Finally Replace the config with the one you now have from step 1",
    "icon": "fas fa-question-circle",
    "id": 3
  },
  "I cannot connect to my server! It always tells me 'Incompatible version'": {
    "answerweb": "There are a few things that can cause this issue. Please follow the steps below.<br><h5>Check the version of Valheim and Valheim Plus on your Game Client and Server:</h5><br><ul><li>Check the version of your game client, to do this, launch Valheim and take a look in the bottom right corner, it should say: \"Version: 0.148.7, Valheim Plus: 0.9.7\", keep a note of those version numbers.</li><li>Check the version of your Valheim server. This will vary depending on how your server is hosted:</li><ul><li>If you use \"Valheim Dedicated Server\" on your Steam library, you can check the version by looking through the server console window, look for a line that looks like this: \"03/29/2021 16:54:09: Valheim version:0.148.7@0.9.\".</li><li>If you use SteamCMD to host your server, the same instructions above should apply. If you use a a server hosting provider (such as ZAP hosting), it should tell you your servers game version in the server control panel/dashboard or the online console. For example, in ZAP Hosting, the console shows the following line: \"[Info : Unity Log] Version generated with enforced mod : 0.148.7@0.9.7\".</li></ul><li>If the version on your server and on your client match exactly, you do not need to worry about this step. If they do not match, it means either the game or the client is outdated in some way. To Fix this, you should check for updates on the Steam game client, your server client and also make sure you are on the latest version of Valheim Plus. The latest Valheim Plus version is: 0.9.7</li></ul><br><h5>Check you have the latest config file for Valheim Plus:</h5><br><ul><li>Another reason that you might get \"incompatible version\" is because you haven't upgraded to a new version of the config file. To check this, you can do the following:</li><ul><li>Go to <a target=\"_blank\" href=\"https://github.com/valheimPlus/ValheimPlus/releases/latest\">https://github.com/valheimPlus/ValheimPlus/releases/latest</a>, and look at the \"valheim_plus.cfg\" file. You may notice it has new options in there. </li><li>If you need to upgrade to the latest config, you can do so by using this website: <a target=\"_blank\" href=\"https://valheim-plus-config.web.app\">https://valheim-plus-config.web.app/</a>.Paste your old config file in to left hand box and choose merge config files, run through the following page which will let you set new options, then save the new config it gives you over the top of your old one. You need to update this config file on your game client and on your server.</li></ul></ul><br><h5>enforceMod is set differently on the game client and on the server:</h5><br>\n<ul><li>Check your config, if you have enforceMod=true set on your server, but enforceMod=false set on your game client, this will cause the incompatible version. Both need to be set to the same. The recommended option is setting it to true, so players who don't use Valheim Plus don't join your server (this would ruin your world).</li></ul><br><h5>Other mods out of date or incompatible:</h5><br><ul><li>You will also need to check for updates to other mods, or possibly remove other mods depending on whether or not they are compatible with the latest game version.</li><li>To do this, please check on the mod's download page, or the mod developer's Discord server.</li></ul>",
    "commanddiscord": "!faq incompatible-version",
    "answerdiscord": "Please make sure that your own client and the server have the appropriate settings configured in their valheim_plus.cfg. If you have enforceConfiguration and enforceMod enabled, only people with the same configuration and mod version can join your server. You can only join servers with the same mod and configuration. You also need to check that you have the same version of Valheim Plus on all clients and the server. For a more detailed answer, check our websites FAQ - https://valheim.plus/faq",
    "icon": "fas fa-question-circle",
    "id": 4
  },
  "How do I edit the features of Valheim Plus?": {
    "answerweb": "To enable, disable or tweak any Valheim Plus settings you need to edit the 'valheim_plus.cfg'.",
    "commanddiscord": "!faq edit-features",
    "answerdiscord": "To enable, disable or tweak any Valheim Plus settings you need to edit the 'valheim_plus.cfg'.",
    "icon": "fas fa-question-circle",
    "id": 5
  },
  "Do all players on my server need Valheim plus installed?": {
    "answerweb": "In order for players to join your Valheim Plus server, every player connecting needs to have Valheim+ installed on their game client.",
    "commanddiscord": "!faq compatibility",
    "answerdiscord": "In order for players to join your Valheim Plus server, every player connecting needs to have Valheim+ installed on their game client.",
    "icon": "fas fa-question-circle",
    "id": 6
  },
  "The mod is loaded, but a feature isn't working": {
    "answerweb": "Each section of the valheim_plus.cfg file has an enabled=true or enabled=false line which will enable or disable that entire section as a whole. If a specific feature is not working, the most likely reason is that section is disabled via enabled=false.",
    "commanddiscord": "!faq feature-not-working",
    "answerdiscord": "Each section of the valheim_plus.cfg file has an enabled=true or enabled=false line which will enable or disable that entire section as a whole. If a specific feature is not working, the most likely reason is that section is disabled via enabled=false.",
    "icon": "fas fa-question-circle",
    "id": 7
  },
  "How do I disable Valheim Plus?": {
    "answerweb": "To disable Valheim Plus, you can do the following:<br><ul><li>1. Open the doorstop_config.ini in the root of the Valheim game's folder. i.e. 'C:\\Program Files (x86)\\Steam\\steamapps\\common\\Valheim'</li><li>2. Change line 3 from 'enabled=true' to 'enabled=false'</li><li>3. Save the file, Valheim Plus should now be disabled when you launch the game.</li></ul>",
    "commanddiscord": "!faq disable-mod",
    "answerdiscord": "To disable Valheim Plus, you can do the following: Open the doorstop_config.ini in the root of the Valheim game's folder. i.e. 'C:\\Program Files (x86)\\Steam\\steamapps\\common\\Valheim', Change line 3 from 'enabled=true' to 'enabled=false', Save the file, Valheim Plus should now be disabled when you launch the game.",
    "icon": "fas fa-question-circle",
    "id": 8
  },
  "How do I enable Valheim Plus if I have previously disabled it?": {
    "answerweb": "To re-enable Valheim Plus, you can do the following:<br><ul><li>1. Open the doorstop_config.ini in the root of the Valheim game's folder. i.e. 'C:\\Program Files (x86)\\Steam\\steamapps\\common\\Valheim'</li><li>2. Change line 3 from 'enabled=false' to 'enabled=true'</li><li>3. Save the file, Valheim Plus should now be enabled when you launch the game.</li></ul>",
    "commanddiscord": "!faq enable-mod",
    "answerdiscord": "To re-enable Valheim Plus, you can do the following: Open the doorstop_config.ini in the root of the Valheim game's folder. i.e. 'C:\\Program Files (x86)\\Steam\\steamapps\\common\\Valheim', Change line 3 from 'enabled=false' to 'enabled=true', Save the file, Valheim Plus should now be enabled when you launch the game.",
    "icon": "fas fa-question-circle",
    "id": 9
  },
  "How do I know what each feature of Valheim Plus can do?": {
    "answerweb": "To see a full list and descriptions of what each feature of the mod can do, check out our documentation here: <a href='https://valheim.plus/documentation'>https://valheim.plus/documentation</a>",
    "commanddiscord": "!faq documentation",
    "answerdiscord": "To see a full list and descriptions of what each feature of the mod can do, check out our documentation here: https://valheim.plus/documentation",
    "icon": "fas fa-question-circle",
    "id": 10
  }
}
